InformationRegisters/ИсторияИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ИсторияИзменений</Name>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Dimension>
      <Name>Пользователь</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Пользователи</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Пользователи</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Attribute>
      <Name>ДатаВремя</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Объект</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Действие</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>СтароеЗначение</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>НовоеЗначение</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

CommonModules/АудитДействий/Ext/Module.bsl
// Запись истории изменений критичных операций

Процедура ЗарегистрироватьИзменение(Объект, Действие, СтароеЗначение = "", НовоеЗначение = "") Экспорт
	Запись = РегистрыСведений.ИсторияИзменений.СоздатьЗапись();
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запись.ДатаВремя = ТекущаяДата();
	Запись.Объект = Строка(Объект);
	Запись.Действие = Действие;
	Запись.СтароеЗначение = Строка(СтароеЗначение);
	Запись.НовоеЗначение = Строка(НовоеЗначение);
	НаборЗаписей = РегистрыСведений.ИсторияИзменений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Запись.Пользователь);
	НаборЗаписей.Записать();
КонецПроцедуры
